
## Plan Result (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8672091519)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_run_service.cloudrun-dev-main-backend
* Update
  * google_storage_bucket.public_image_bucket


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_service.cloudrun-dev-main-backend will be created
  + resource "google_cloud_run_service" "cloudrun-dev-main-backend" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "dev-main-backend"
      + project                    = "lgtmgen-project"
      + status                     = (known after apply)

      + template {
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend"
                  + name  = (known after apply)
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"run-terraform-plan","PRNumber":10,"Program":"tfcmt","SHA1":"daf22dd003a11e1ae76bfa52165ef4dcb703cb61","Target":"dev","Vars":{},"WorkflowName":"Run terragrunt plan on PR submission"} -->